app/controllers/tamesis_controller.rb

SELECT "tamesis".* FROM "tamesis"
---
  def index
    @tamesis = Tamesi.all

INSERT INTO "tamesis" ("category_id", "name", "address", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["category_id", 1], ["name", "a"], ["address", "a"], ["created_at", "2021-10-22 05:14:44.290577"], ["updated_at", "2021-10-22 05:14:44.290577"]]
---
  def create
    @tamesi = Tamesi.new(tamesi_params)

    respond_to do |format|
      if @tamesi.save

SELECT "tamesis".* FROM "tamesis" WHERE "tamesis"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_tamesi
      @tamesi = Tamesi.find(params[:id])