app/controllers/welcomes_controller.rb

SELECT "welcomes".* FROM "welcomes"
---
  def start
    @welcomes = Welcomes.all

INSERT INTO "welcomes" ("title", "hajime", "owari", "syuujitu", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", ""], ["hajime", "2021-10-04 15:00:00"], ["owari", "2021-10-19 15:00:00"], ["syuujitu", ""], ["created_at", "2021-10-23 04:51:42.489534"], ["updated_at", "2021-10-23 04:51:42.489534"]]
---
      def create
        @welcomes = Welcomes.new(params.permit(:title, :hajime, :owari, :syuujitu, :memo))
      if @welcomes.save

SELECT "welcomes".* FROM "welcomes" WHERE "welcomes"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
      def show
        @welcome = Welcomes.find(params[:id])

SELECT "welcomes".* FROM "welcomes" WHERE "welcomes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      def edit
        @welcome = Welcomes.find(params[:id])

SELECT "welcomes".* FROM "welcomes" WHERE "welcomes"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "welcomes" SET "title" = $1, "updated_at" = $2, "memo" = $3 WHERE "welcomes"."id" = $4  [["title", "aaaa"], ["updated_at", "2021-10-22 03:34:18.112985"], ["memo", "aaa"], ["id", 5]]
---
      def update
      @welcome = Welcomes.find(params[:id])
      if @welcome.update(params.require(:welcomes).permit(:title, :hajime, :owari, :syuujitu, :memo))

SELECT "welcomes".* FROM "welcomes" WHERE "welcomes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "welcomes" WHERE "welcomes"."id" = $1  [["id", 1]]
---
      def destroy
      @welcome = Welcomes.find(params[:id])
      @welcome.destroy